ec2/cases/standard-openfoam200_0-1-pimple/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         20.0;

deltaT          1e-04;

writeControl    adjustableRunTime;

writeInterval   5.0e-1;

purgeWrite      0;

writeFormat     binary;

writePrecision  6;

writeCompression uncompressed;

timeFormat      scientific;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep    yes;

maxCo             0.5;

maxDeltaT         2.0e-3;

functions
{
    probes
    {
        type            probes;
        functionObjectLibs ("libsampling.so");
        enabled         true;
        outputControl   timeStep;
        outputInterval  1;
        probeLocations
        (
            ( 0.05   0.0   0.002 )
            ( 0.05   0.01  0.002 )
            ( 0.05   0.01  0.002 )
            ( 0.05   0.01  0.002 )
            ( 0.05   0.01  0.002 )
            ( 0.05   0.01  0.002 )
            ( 0.05   0.01  0.002 )
        );

        fields
        (
            p
        );
    }

    forces
    {
        type        forceCoeffs;
        functionObjectLibs ( "libforces.so" );
        outputControl timeStep;
        outputInterval 1;
        patches
        (
            walls
        );
		directForceDensity no;

        pName       p;
        UName       U;
        rhoName     rhoInf;
        //log         true;
        rhoInf      994.5;
        CofR        ( 0 0 0 );
        liftDir     ( 0 1 0 );
        dragDir     ( 1 0 0 );
        pitchAxis   ( 0 0 1 );
        magUInf     0.54;
        lRef        0.04;
        Aref        0.0157;
        Aref1        0.004;
        rhoRef      994.5;
    }

    fieldAverage1
    {
        type            fieldAverage;
        functionObjectLibs ("libfieldFunctionObjects.so");
        enabled         true;
        outputControl   outputTime;
        fields
        (
            U
            {
                mean        on;
                prime2Mean  on;
                base        time;
            }

            p
            {
                mean        on;
                prime2Mean  on;
                base        time;
            }
        );
    }
}


// ************************************************************************* //
